
var heroes=["李白",'蔡文姬','韩信','赵云','甄姬','阿珂','貂蝉','妲己'];
console.log(heroes.slice(1,4)); //  [ "蔡文姬", "韩信", "赵云" ]开始索引为1 结束索引为4(不包括4)
console.log(heroes); // 不改变原数组  [ "李白", "蔡文姬", "韩信", "赵云", "甄姬", "阿珂", "貂蝉", "妲己" ]

//  如果开始索引为负数，将该值加上数组长度后作为开始索引，如果此时还为负数，开始索引为0。
var heroes2 = ["李白",'蔡文姬','韩信','赵云','甄姬','阿珂','貂蝉','妲己'];
console.log(heroes2.slice(-6,4)); //  [ "韩信", "赵云" ]开始索引为2 结束索引为4(不包括4)
console.log(heroes2.slice(-10,4)); //  [ "李白", "蔡文姬", "韩信", "赵云" ]开始索引为0 结束索引为4(不包括4)

// 如果开始索引大于或等于数组的长度,slice()返回空数组。
var heroes3 = ["李白",'蔡文姬','韩信','赵云','甄姬','阿珂','貂蝉','妲己'];
console.log(heroes3.slice(8,4)); //  [ ]
console.log(heroes3.slice(10,4)); //  [ ]
console.log(heroes3.slice(4,4)); //[ ]
console.log(heroes3.slice(5,4));  //[ ]

// 如果结束索引省略，则截取到数组最后一位。如果为负,数组长度加上该值即为结束索引,如果此时还为负数,返回空数组。

var heroes4 = ["李白",'蔡文姬','韩信','赵云','甄姬','阿珂','貂蝉','妲己'];
console.log(heroes4.slice(1)); // [ "蔡文姬", "韩信", "赵云", "甄姬", "阿珂", "貂蝉", "妲己" ]
console.log(heroes4.slice(1,-4)); //  [ "蔡文姬", "韩信", "赵云" ] 开始索引1  结束索引8+(-4)=4
console.log(heroes4.slice(1,-10)); //[ ] 开始索引1  结束索引8+(-10)=-2
